lisp-in-rust/hello-lisp/index.html
<!DOCTYPE html><html lang="en"><head><meta charset="UTF-8"/><title>Hello, Lisp</title><link rel="stylesheet" href="/styles.css"/></head><body><table width="100%" cellpadding="0" cellspacing="0" border="0" id="header"><td align="left"><b>Hello, Lisp</b> | <a href=../>Go back</a></td><td align="right">Written by <a href="https://github.com/knarkzel">Knarkzel</a></td></table><p>
To get started, lets create a new project named lisp:
</p>

<div class="org-src-container">
<pre class="src src-shell">$ cargo new lisp
     Created binary <span class="org-rainbow-delimiters-depth-1">(</span>application<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-sh-quoted-exec">`lisp`</span> package
$ cd lisp
$ cargo add nom anyhow
    Updating crates.io index
      Adding nom v7.1.2 to dependencies.
             Features:
             + alloc
             + std
             - docsrs
      Adding anyhow v1.0.68 to dependencies.
             Features:
             + std
             - backtrace
</pre>
</div>

<div id="outline-container-org5ecfa70" class="outline-2">
<h2 id="org5ecfa70">Final code</h2>
<div class="outline-text-2" id="text-org5ecfa70">
<div class="org-src-container">
<pre class="src src-rust"><span class="org-keyword">use</span> <span class="org-constant">anyhow</span>::<span class="org-rainbow-delimiters-depth-1">{</span>anyhow, <span class="org-type">Result</span><span class="org-rainbow-delimiters-depth-1">}</span>;
<span class="org-keyword">use</span> <span class="org-constant">nom</span>::<span class="org-rainbow-delimiters-depth-1">{</span>
    <span class="org-constant">branch</span>::alt,
    <span class="org-constant">bytes</span>::<span class="org-constant">complete</span>::tag,
    <span class="org-constant">character</span>::<span class="org-constant">complete</span>::<span class="org-rainbow-delimiters-depth-2">{</span>digit1, multispace0<span class="org-rainbow-delimiters-depth-2">}</span>,
    <span class="org-constant">combinator</span>::map,
    <span class="org-constant">multi</span>::many1,
    <span class="org-constant">sequence</span>::delimited,
    <span class="org-type">IResult</span>,
<span class="org-rainbow-delimiters-depth-1">}</span>;
<span class="org-keyword">use</span> <span class="org-constant">rustyline</span>::<span class="org-rainbow-delimiters-depth-1">{</span><span class="org-constant">error</span>::<span class="org-type">ReadlineError</span>, <span class="org-type">Editor</span><span class="org-rainbow-delimiters-depth-1">}</span>;

<span class="org-comment-delimiter">// </span><span class="org-comment">Parser</span>
<span class="org-preprocessor">#</span><span class="org-preprocessor"><span class="org-rainbow-delimiters-depth-1">[</span></span><span class="org-preprocessor">derive</span><span class="org-preprocessor"><span class="org-rainbow-delimiters-depth-2">(</span></span><span class="org-preprocessor">Debug</span><span class="org-preprocessor"><span class="org-rainbow-delimiters-depth-2">)</span></span><span class="org-preprocessor"><span class="org-rainbow-delimiters-depth-1">]</span></span>
<span class="org-keyword">enum</span> <span class="org-type">Operator</span> <span class="org-rainbow-delimiters-depth-1">{</span>
    <span class="org-type">Plus</span>,
    <span class="org-type">Minus</span>,
    <span class="org-type">Divide</span>,
    <span class="org-type">Multiply</span>,
<span class="org-rainbow-delimiters-depth-1">}</span>

<span class="org-preprocessor">#</span><span class="org-preprocessor"><span class="org-rainbow-delimiters-depth-1">[</span></span><span class="org-preprocessor">derive</span><span class="org-preprocessor"><span class="org-rainbow-delimiters-depth-2">(</span></span><span class="org-preprocessor">Debug</span><span class="org-preprocessor"><span class="org-rainbow-delimiters-depth-2">)</span></span><span class="org-preprocessor"><span class="org-rainbow-delimiters-depth-1">]</span></span>
<span class="org-keyword">enum</span> <span class="org-type">Atom</span> <span class="org-rainbow-delimiters-depth-1">{</span>
    <span class="org-type">Number</span><span class="org-rainbow-delimiters-depth-2">(</span><span class="org-type">isize</span><span class="org-rainbow-delimiters-depth-2">)</span>,
    <span class="org-type">Operator</span><span class="org-rainbow-delimiters-depth-2">(</span><span class="org-type">Operator</span><span class="org-rainbow-delimiters-depth-2">)</span>,
<span class="org-rainbow-delimiters-depth-1">}</span>

<span class="org-keyword">fn</span> <span class="org-function-name">operator</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-variable-name">input</span>: <span class="org-rust-ampersand">&amp;</span><span class="org-type">str</span><span class="org-rainbow-delimiters-depth-1">)</span> -&gt; <span class="org-type">IResult</span><span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-rust-ampersand">&amp;</span><span class="org-type">str</span>, <span class="org-type">Atom</span><span class="org-rainbow-delimiters-depth-1">&gt;</span> <span class="org-rainbow-delimiters-depth-1">{</span>
    <span class="org-keyword">let</span> <span class="org-variable-name">plus</span> = map<span class="org-rainbow-delimiters-depth-2">(</span>tag<span class="org-rainbow-delimiters-depth-3">(</span><span class="org-string">"+"</span><span class="org-rainbow-delimiters-depth-3">)</span>, |_| <span class="org-type">Operator</span>::<span class="org-type">Plus</span><span class="org-rainbow-delimiters-depth-2">)</span>;
    <span class="org-keyword">let</span> <span class="org-variable-name">minus</span> = map<span class="org-rainbow-delimiters-depth-2">(</span>tag<span class="org-rainbow-delimiters-depth-3">(</span><span class="org-string">"-"</span><span class="org-rainbow-delimiters-depth-3">)</span>, |_| <span class="org-type">Operator</span>::<span class="org-type">Minus</span><span class="org-rainbow-delimiters-depth-2">)</span>;
    <span class="org-keyword">let</span> <span class="org-variable-name">divide</span> = map<span class="org-rainbow-delimiters-depth-2">(</span>tag<span class="org-rainbow-delimiters-depth-3">(</span><span class="org-string">"/"</span><span class="org-rainbow-delimiters-depth-3">)</span>, |_| <span class="org-type">Operator</span>::<span class="org-type">Divide</span><span class="org-rainbow-delimiters-depth-2">)</span>;
    <span class="org-keyword">let</span> <span class="org-variable-name">multiply</span> = map<span class="org-rainbow-delimiters-depth-2">(</span>tag<span class="org-rainbow-delimiters-depth-3">(</span><span class="org-string">"*"</span><span class="org-rainbow-delimiters-depth-3">)</span>, |_| <span class="org-type">Operator</span>::<span class="org-type">Multiply</span><span class="org-rainbow-delimiters-depth-2">)</span>;
    map<span class="org-rainbow-delimiters-depth-2">(</span>alt<span class="org-rainbow-delimiters-depth-3">(</span><span class="org-rainbow-delimiters-depth-4">(</span>plus, minus, divide, multiply<span class="org-rainbow-delimiters-depth-4">)</span><span class="org-rainbow-delimiters-depth-3">)</span>, <span class="org-type">Atom</span>::<span class="org-type">Operator</span><span class="org-rainbow-delimiters-depth-2">)(</span>input<span class="org-rainbow-delimiters-depth-2">)</span>
<span class="org-rainbow-delimiters-depth-1">}</span>

<span class="org-keyword">fn</span> <span class="org-function-name">number</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-variable-name">input</span>: <span class="org-rust-ampersand">&amp;</span><span class="org-type">str</span><span class="org-rainbow-delimiters-depth-1">)</span> -&gt; <span class="org-type">IResult</span><span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-rust-ampersand">&amp;</span><span class="org-type">str</span>, <span class="org-type">Atom</span><span class="org-rainbow-delimiters-depth-1">&gt;</span> <span class="org-rainbow-delimiters-depth-1">{</span>
    map<span class="org-rainbow-delimiters-depth-2">(</span>digit1, |<span class="org-variable-name">digits</span>: <span class="org-rust-ampersand">&amp;</span><span class="org-type">str</span>| <span class="org-rainbow-delimiters-depth-3">{</span>
        <span class="org-type">Atom</span>::<span class="org-type">Number</span><span class="org-rainbow-delimiters-depth-4">(</span>digits.parse::<span class="org-rainbow-delimiters-depth-5">&lt;</span><span class="org-type">isize</span><span class="org-rainbow-delimiters-depth-5">&gt;()</span>.unwrap<span class="org-rainbow-delimiters-depth-5">()</span><span class="org-rainbow-delimiters-depth-4">)</span>
    <span class="org-rainbow-delimiters-depth-3">}</span><span class="org-rainbow-delimiters-depth-2">)(</span>input<span class="org-rainbow-delimiters-depth-2">)</span>
<span class="org-rainbow-delimiters-depth-1">}</span>

<span class="org-keyword">fn</span> <span class="org-function-name">atom</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-variable-name">input</span>: <span class="org-rust-ampersand">&amp;</span><span class="org-type">str</span><span class="org-rainbow-delimiters-depth-1">)</span> -&gt; <span class="org-type">IResult</span><span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-rust-ampersand">&amp;</span><span class="org-type">str</span>, <span class="org-type">Atom</span><span class="org-rainbow-delimiters-depth-1">&gt;</span> <span class="org-rainbow-delimiters-depth-1">{</span>
    <span class="org-keyword">let</span> <span class="org-variable-name">options</span> = alt<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-rainbow-delimiters-depth-3">(</span>operator, number<span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span>;
    delimited<span class="org-rainbow-delimiters-depth-2">(</span>multispace0, options, multispace0<span class="org-rainbow-delimiters-depth-2">)(</span>input<span class="org-rainbow-delimiters-depth-2">)</span>
<span class="org-rainbow-delimiters-depth-1">}</span>

<span class="org-keyword">fn</span> <span class="org-function-name">parse</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-variable-name">input</span>: <span class="org-rust-ampersand">&amp;</span><span class="org-type">str</span><span class="org-rainbow-delimiters-depth-1">)</span> -&gt; <span class="org-type">IResult</span><span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-rust-ampersand">&amp;</span><span class="org-type">str</span>, <span class="org-type">Vec</span><span class="org-rainbow-delimiters-depth-2">&lt;</span><span class="org-type">Atom</span><span class="org-rainbow-delimiters-depth-2">&gt;</span><span class="org-rainbow-delimiters-depth-1">&gt;</span> <span class="org-rainbow-delimiters-depth-1">{</span>
    delimited<span class="org-rainbow-delimiters-depth-2">(</span>tag<span class="org-rainbow-delimiters-depth-3">(</span><span class="org-string">"("</span><span class="org-rainbow-delimiters-depth-3">)</span>, many1<span class="org-rainbow-delimiters-depth-3">(</span>atom<span class="org-rainbow-delimiters-depth-3">)</span>, tag<span class="org-rainbow-delimiters-depth-3">(</span><span class="org-string">")"</span><span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)(</span>input<span class="org-rainbow-delimiters-depth-2">)</span>
<span class="org-rainbow-delimiters-depth-1">}</span>

<span class="org-comment-delimiter">// </span><span class="org-comment">Helpers</span>
<span class="org-keyword">fn</span> <span class="org-function-name">atoms_to_numbers</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-variable-name">atoms</span>: <span class="org-rust-ampersand">&amp;</span><span class="org-rainbow-delimiters-depth-2">[</span><span class="org-type">Atom</span><span class="org-rainbow-delimiters-depth-2">]</span><span class="org-rainbow-delimiters-depth-1">)</span> -&gt; <span class="org-type">Result</span><span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-type">Vec</span><span class="org-rainbow-delimiters-depth-2">&lt;</span><span class="org-type">isize</span><span class="org-rainbow-delimiters-depth-2">&gt;</span><span class="org-rainbow-delimiters-depth-1">&gt;</span> <span class="org-rainbow-delimiters-depth-1">{</span>
    <span class="org-keyword">let</span> <span class="org-variable-name">numbers</span> = atoms
        .iter<span class="org-rainbow-delimiters-depth-2">()</span>
        .map<span class="org-rainbow-delimiters-depth-2">(</span>|atom| <span class="org-keyword">match</span> atom <span class="org-rainbow-delimiters-depth-3">{</span>
            <span class="org-type">Atom</span>::<span class="org-type">Number</span><span class="org-rainbow-delimiters-depth-4">(</span>number<span class="org-rainbow-delimiters-depth-4">)</span> =&gt; <span class="org-type">Ok</span><span class="org-rainbow-delimiters-depth-4">(</span>*number<span class="org-rainbow-delimiters-depth-4">)</span>,
            atom =&gt; <span class="org-type">Err</span><span class="org-rainbow-delimiters-depth-4">(</span><span class="org-preprocessor">anyhow!</span><span class="org-rainbow-delimiters-depth-5">(</span><span class="org-string">"Expected number, got {atom:?}"</span><span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span>,
        <span class="org-rainbow-delimiters-depth-3">}</span><span class="org-rainbow-delimiters-depth-2">)</span>
        .collect::<span class="org-rainbow-delimiters-depth-2">&lt;</span><span class="org-type">Result</span><span class="org-rainbow-delimiters-depth-3">&lt;</span><span class="org-type">Vec</span><span class="org-rainbow-delimiters-depth-4">&lt;</span>_<span class="org-rainbow-delimiters-depth-4">&gt;</span>, _<span class="org-rainbow-delimiters-depth-3">&gt;</span><span class="org-rainbow-delimiters-depth-2">&gt;()</span><span class="org-rust-question-mark">?</span>;
    <span class="org-type">Ok</span><span class="org-rainbow-delimiters-depth-2">(</span>numbers<span class="org-rainbow-delimiters-depth-2">)</span>
<span class="org-rainbow-delimiters-depth-1">}</span>

<span class="org-comment-delimiter">// </span><span class="org-comment">Evaluator</span>
<span class="org-keyword">fn</span> <span class="org-function-name">eval</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-variable-name">atoms</span>: <span class="org-rust-ampersand">&amp;</span><span class="org-rainbow-delimiters-depth-2">[</span><span class="org-type">Atom</span><span class="org-rainbow-delimiters-depth-2">]</span><span class="org-rainbow-delimiters-depth-1">)</span> -&gt; <span class="org-type">Result</span><span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-type">Atom</span><span class="org-rainbow-delimiters-depth-1">&gt;</span> <span class="org-rainbow-delimiters-depth-1">{</span>
    <span class="org-keyword">match</span> atoms <span class="org-rainbow-delimiters-depth-2">{</span>
        <span class="org-rainbow-delimiters-depth-3">[</span><span class="org-type">Atom</span>::<span class="org-type">Operator</span><span class="org-rainbow-delimiters-depth-4">(</span>operator<span class="org-rainbow-delimiters-depth-4">)</span>, tail @ ..<span class="org-rainbow-delimiters-depth-3">]</span> =&gt; <span class="org-rainbow-delimiters-depth-3">{</span>
            <span class="org-keyword">let</span> <span class="org-variable-name">numbers</span> = atoms_to_numbers<span class="org-rainbow-delimiters-depth-4">(</span>tail<span class="org-rainbow-delimiters-depth-4">)</span><span class="org-rust-question-mark">?</span>;
            <span class="org-keyword">let</span> <span class="org-variable-name">total</span> = numbers
                .into_iter<span class="org-rainbow-delimiters-depth-4">()</span>
                .reduce<span class="org-rainbow-delimiters-depth-4">(</span>|total, number| <span class="org-keyword">match</span> operator <span class="org-rainbow-delimiters-depth-5">{</span>
                    <span class="org-type">Operator</span>::<span class="org-type">Plus</span> =&gt; total + number,
                    <span class="org-type">Operator</span>::<span class="org-type">Minus</span> =&gt; total - number,
                    <span class="org-type">Operator</span>::<span class="org-type">Divide</span> =&gt; total / number,
                    <span class="org-type">Operator</span>::<span class="org-type">Multiply</span> =&gt; total * number,
                <span class="org-rainbow-delimiters-depth-5">}</span><span class="org-rainbow-delimiters-depth-4">)</span>
                .ok_or_else<span class="org-rainbow-delimiters-depth-4">(</span>|| <span class="org-preprocessor">anyhow!</span><span class="org-rainbow-delimiters-depth-5">(</span><span class="org-string">"Tail is empty"</span><span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span><span class="org-rust-question-mark">?</span>;
            <span class="org-type">Ok</span><span class="org-rainbow-delimiters-depth-4">(</span><span class="org-type">Atom</span>::<span class="org-type">Number</span><span class="org-rainbow-delimiters-depth-5">(</span>total<span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span>
        <span class="org-rainbow-delimiters-depth-3">}</span>
        atoms =&gt; <span class="org-type">Err</span><span class="org-rainbow-delimiters-depth-3">(</span><span class="org-preprocessor">anyhow!</span><span class="org-rainbow-delimiters-depth-4">(</span><span class="org-string">"Invalid input: {atoms:#?}"</span><span class="org-rainbow-delimiters-depth-4">)</span><span class="org-rainbow-delimiters-depth-3">)</span>,
    <span class="org-rainbow-delimiters-depth-2">}</span>
<span class="org-rainbow-delimiters-depth-1">}</span>

<span class="org-keyword">fn</span> <span class="org-function-name">main</span><span class="org-rainbow-delimiters-depth-1">()</span> -&gt; <span class="org-type">Result</span><span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-rainbow-delimiters-depth-2">()</span><span class="org-rainbow-delimiters-depth-1">&gt;</span> <span class="org-rainbow-delimiters-depth-1">{</span>
    <span class="org-keyword">let</span> <span class="org-keyword">mut</span> <span class="org-variable-name">editor</span> = <span class="org-type">Editor</span>::<span class="org-rainbow-delimiters-depth-2">&lt;</span><span class="org-rainbow-delimiters-depth-3">()</span><span class="org-rainbow-delimiters-depth-2">&gt;</span>::new<span class="org-rainbow-delimiters-depth-2">()</span><span class="org-rust-question-mark">?</span>;
    <span class="org-keyword">loop</span> <span class="org-rainbow-delimiters-depth-2">{</span>
        <span class="org-keyword">match</span> editor.readline<span class="org-rainbow-delimiters-depth-3">(</span><span class="org-string">"&gt;&gt; "</span><span class="org-rainbow-delimiters-depth-3">)</span> <span class="org-rainbow-delimiters-depth-3">{</span>
            <span class="org-type">Ok</span><span class="org-rainbow-delimiters-depth-4">(</span>input<span class="org-rainbow-delimiters-depth-4">)</span> =&gt; <span class="org-keyword">match</span> parse<span class="org-rainbow-delimiters-depth-4">(</span><span class="org-rust-ampersand">&amp;</span>input<span class="org-rainbow-delimiters-depth-4">)</span> <span class="org-rainbow-delimiters-depth-4">{</span>
                <span class="org-type">Ok</span><span class="org-rainbow-delimiters-depth-5">(</span><span class="org-rainbow-delimiters-depth-6">(</span>_, atoms<span class="org-rainbow-delimiters-depth-6">)</span><span class="org-rainbow-delimiters-depth-5">)</span> =&gt; <span class="org-rainbow-delimiters-depth-5">{</span>
                    <span class="org-keyword">let</span> <span class="org-variable-name">output</span> = eval<span class="org-rainbow-delimiters-depth-6">(</span><span class="org-rust-ampersand">&amp;</span>atoms<span class="org-rainbow-delimiters-depth-6">)</span><span class="org-rust-question-mark">?</span>;
                    <span class="org-rust-builtin-formatting-macro">println!</span><span class="org-rainbow-delimiters-depth-6">(</span><span class="org-string">"</span><span class="org-rust-string-interpolation">{output:?}</span><span class="org-string">"</span><span class="org-rainbow-delimiters-depth-6">)</span>;
                <span class="org-rainbow-delimiters-depth-5">}</span>
                <span class="org-type">Err</span><span class="org-rainbow-delimiters-depth-5">(</span>error<span class="org-rainbow-delimiters-depth-5">)</span> =&gt; <span class="org-rust-builtin-formatting-macro">println!</span><span class="org-rainbow-delimiters-depth-5">(</span><span class="org-string">"</span><span class="org-rust-string-interpolation">{error}</span><span class="org-string">"</span><span class="org-rainbow-delimiters-depth-5">)</span>,
            <span class="org-rainbow-delimiters-depth-4">}</span>,
            <span class="org-type">Err</span><span class="org-rainbow-delimiters-depth-4">(</span><span class="org-type">ReadlineError</span>::<span class="org-type">Interrupted</span> | <span class="org-type">ReadlineError</span>::<span class="org-type">Eof</span><span class="org-rainbow-delimiters-depth-4">)</span> =&gt; <span class="org-keyword">break</span>,
            <span class="org-type">Err</span><span class="org-rainbow-delimiters-depth-4">(</span>error<span class="org-rainbow-delimiters-depth-4">)</span> =&gt; <span class="org-rainbow-delimiters-depth-4">{</span>
                <span class="org-rust-builtin-formatting-macro">println!</span><span class="org-rainbow-delimiters-depth-5">(</span><span class="org-string">"Error: </span><span class="org-rust-string-interpolation">{error}</span><span class="org-string">"</span><span class="org-rainbow-delimiters-depth-5">)</span>;
                <span class="org-keyword">break</span>;
            <span class="org-rainbow-delimiters-depth-4">}</span>
        <span class="org-rainbow-delimiters-depth-3">}</span>
    <span class="org-rainbow-delimiters-depth-2">}</span>
    <span class="org-type">Ok</span><span class="org-rainbow-delimiters-depth-2">(</span><span class="org-rainbow-delimiters-depth-3">()</span><span class="org-rainbow-delimiters-depth-2">)</span>
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org822b518" class="outline-2">
<h2 id="org822b518">Result</h2>
<div class="outline-text-2" id="text-org822b518">
<div class="org-src-container">
<pre class="src src-shell">lisp &#10095; cargo run
    Finished dev <span class="org-rainbow-delimiters-depth-1">[</span>unoptimized + debuginfo<span class="org-rainbow-delimiters-depth-1">]</span> target<span class="org-rainbow-delimiters-depth-1">(</span>s<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-keyword">in</span> 0.02s
     Running <span class="org-sh-quoted-exec">`target/debug/lisp`</span>
&gt;&gt; <span class="org-rainbow-delimiters-depth-1">(</span>+ 1 2 3 4 5<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-function-name">Number</span><span class="org-rainbow-delimiters-depth-1">(</span>15<span class="org-rainbow-delimiters-depth-1">)</span>
&gt;&gt; <span class="org-rainbow-delimiters-depth-1">(</span>* 2 4 6 8<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-function-name">Number</span><span class="org-rainbow-delimiters-depth-1">(</span>384<span class="org-rainbow-delimiters-depth-1">)</span>
&gt;&gt; <span class="org-rainbow-delimiters-depth-1">(</span>/ 100 25<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-function-name">Number</span><span class="org-rainbow-delimiters-depth-1">(</span>4<span class="org-rainbow-delimiters-depth-1">)</span>
&gt;&gt; <span class="org-rainbow-delimiters-depth-1">(</span>- 10 5 3<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-function-name">Number</span><span class="org-rainbow-delimiters-depth-1">(</span>2<span class="org-rainbow-delimiters-depth-1">)</span>
&gt;&gt;
</pre>
</div>

<pre>
lisp
├── src
│   └── <a href="./lisp/src/main.rs">main.rs</a>
├── <a href="./lisp/Cargo.lock">Cargo.lock</a>
└── <a href="./lisp/Cargo.toml">Cargo.toml</a>
</pre>
</div>
</div>
</body></html>
